# База данных пользователей
users = [
    {"name": "Серега Пират", "direction": "AI"},
    {"name": "Алишер Моргенштерн", "direction": "DEV"},
    {"name": "Олег Данилов", "direction": "DATA"},
    {"name": "Антон Балов", "direction": "DEV"}
]

# База данных заданий по направлениям
tasks = {
    "DEV": [
        {
            "id": 1,
            "title": "Базовое задание по программированию",
            "description": """Задание:
Написать программу, которая:
1. Запрашивает у пользователя число n
2. Генерирует список из n случайных чисел (от 1 до 100)
3. Выводит минимальное, максимальное и среднее значение в списке
4. Дополнительно: отсортировать список и вывести его"""
        },
        {
            "title": "Веб-приложение на Flask",
            "description": "Создать простое веб-приложение с 3 маршрутами"
        }
    ],
    "AI": [
        {
            "title": "Линейная регрессия",
            "description": "Реализовать метод наименьших квадратов для линейной регрессии"
        }
    ],
    "DATA": [
        {
            "title": "Анализ данных",
            "description": "Проанализировать датасет с помощью Pandas и визуализировать результаты"
        }
    ]
}