# База данных пользователей
users = [
    {"name": "Серега Пират", "course": 2, "direction": "AI"},
    {"name": "Алишер Моргенштерн", "course": 1, "direction": "DEV"},
    {"name": "Олег Данилов", "course": 1, "direction": "DATA"},
    {"name": "Антон Балов", "course": 1, "direction": "DEV"}
]

# Баллы пользователей
users_score = [
    {"name": "Серега Пират", "python": 4, "math": 3},
    {"name": "Алишер Моргенштерн", "java": 3, "math": 5},
    {"name": "Олег Данилов", "python": 5, "economics": 5},
    {"name": "Антон Балов", "java": 2, "math": 4}
]

tasks = {
    1: {  # Общие задания для 1 курса
        "common": [
            {
                "title": "Основы программирования",
                "description": "Написать программу 'Hello World' на любом языке"
            },
            {
                "title": "Математический анализ",
                "description": "Решить 5 задач по пределам функций"
            }
        ]
    },
    2: {  # Специализированные задания для 2 курса
        "AI": [
            {
                "title": "Нейронные сети",
                "description": "Реализовать перцептрон для задачи классификации"
            }
        ],
        "DEV": [
            {
                "title": "Веб-разработка",
                "description": "Создать простое веб-приложение на Flask"
            }
        ],
        "DATA": [
            {
                "title": "Анализ данных",
                "description": "Проанализировать датасет с помощью Pandas"
            }
        ]
    }
}